eisup_2019_docmng_integration/src/Documents/абс_РазукрупнениеОСРЖД/абс_РазукрупнениеОСРЖД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>абс_РазукрупнениеОСРЖД</name>
  <basedOn>Document.абс_РазукрупнениеОС</basedOn>
  <registerRecords>AccumulationRegister.абс_СтоимостьОСРЖД</registerRecords>
  <registerRecords>AccountingRegister.абс_МеждународныйОСРЖД</registerRecords>
  <registerRecords>InformationRegister.абс_ОсновныеСредстваРЖД</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.абс_РазукрупнениеОС</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновноеСредство</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОсновныеСредства</name>
    <attributes>
      <name>ОсновноеСредство</name>
      <type>
        <types>CatalogRef.ОсновныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>13</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СчетУчета</name>
      <type>
        <types>ChartOfAccountsRef.абс_МеждународныйОСРЖД</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетНачисленияАмортизации</name>
      <type>
        <types>ChartOfAccountsRef.абс_МеждународныйОСРЖД</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетЗатрат</name>
      <type>
        <types>ChartOfAccountsRef.абс_МеждународныйОСРЖД</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто1</name>
      <type>
        <types>Characteristic.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто2</name>
      <type>
        <types>Characteristic.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто3</name>
      <type>
        <types>Characteristic.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетСниженияСтоимости</name>
      <type>
        <types>ChartOfAccountsRef.абс_МеждународныйОСРЖД</types>
      </type>
    </attributes>
    <attributes>
      <name>Местонахождение</name>
      <type>
        <types>CatalogRef.ПодразделенияОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>МОЛ</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>КоэффициентУскорения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НачислятьАмортизацию</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокПолезногоИспользования</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПринятияКУчету</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МетодНачисленияАмортизации</name>
      <type>
        <types>EnumRef.МетодыНачисленияАмортизацииОСМеждународный</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

eisup_2019_docmng_integration/src/InformationRegisters/абс_ОсновныеСредстваРЖД/абс_ОсновныеСредстваРЖД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>абс_ОсновныеСредстваРЖД</name>
  <comment>(Упр) Сведения об объектах ОС  для целей РЖД</comment>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Организация</name>
    <comment>Организация, на балансе которой учитывется объект ОС в международном учете</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПринятияКУчету</name>
    <comment>Дата принятия объекта к международному учету</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>МестонахождениеОбъекта</name>
    <comment>Подразделение организации, в котором находится объект ОС</comment>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </resources>
  <resources>
    <name>МОЛ</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.ВидыСостоянийОС</types>
    </type>
  </resources>
  <resources>
    <name>СчетУчета</name>
    <comment>Счет учета в плане счетов Международный РЖД</comment>
    <type>
      <types>ChartOfAccountsRef.абс_МеждународныйОСРЖД</types>
    </type>
  </resources>
  <resources>
    <name>СрокПолезногоИспользования</name>
    <comment>Срок полезного использования в месяцах</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НачислятьАмортизацию</name>
    <comment>Булево - начиляется амортизация или нет</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>МетодНачисленияАмортизации</name>
    <comment>Метод начисления амортизации по международному учету</comment>
    <type>
      <types>EnumRef.МетодыНачисленияАмортизацииОСМеждународный</types>
    </type>
  </resources>
  <resources>
    <name>СчетНачисленияАмортизации</name>
    <comment>Счет, на котором накапливается начисленная амортизация</comment>
    <type>
      <types>ChartOfAccountsRef.абс_МеждународныйОСРЖД</types>
    </type>
  </resources>
  <resources>
    <name>ПервоначальнаяСтоимость</name>
    <comment>Первоначальная (историческая) стоимость объекта</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СправедливаяСтоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЛиквидационнаяСтоимость</name>
    <comment>Стоимость, которая должна остаться после истечения срока полезного использования</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СчетЗатрат</name>
    <comment>Счет учета, в дебет которого относятся амортизационные отчисления</comment>
    <type>
      <types>ChartOfAccountsRef.абс_МеждународныйОСРЖД</types>
    </type>
  </resources>
  <resources>
    <name>Субконто1</name>
    <comment>Субконто первого уровня счета, в дебет которого относится амортизация</comment>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </resources>
  <resources>
    <name>Субконто2</name>
    <comment>Субконто второго уровня счета, в дебет которого относится амортизация</comment>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </resources>
  <resources>
    <name>Субконто3</name>
    <comment>Субконто третьего уровня счета, в дебет которого относится амортизация</comment>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </resources>
  <resources>
    <name>ПредполагаемыйОбъемПродукции</name>
    <comment>Используется при амортизации пропорционально объему продукции</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаНачисленнойАмортизации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УбытокОтОбесценения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоэффициентУскорения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СчетСниженияСтоимости</name>
    <type>
      <types>ChartOfAccountsRef.абс_МеждународныйОСРЖД</types>
    </type>
  </resources>
  <dimensions>
    <name>ОсновноеСредство</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/AccumulationRegisters/абс_СтоимостьОСРЖД/абс_СтоимостьОСРЖД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>абс_СтоимостьОСРЖД</name>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Амортизация</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ОсновноеСредство</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

eisup_2019_docmng_integration/src/InformationRegisters/абс_СоответствиеОКОФГруппОСРЖД/абс_СоответствиеОКОФГруппОСРЖД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>абс_СоответствиеОКОФГруппОСРЖД</name>
  <resources>
    <name>СрокПолезногоИспользования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентЛиквидационнойСтоимости</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ОКОФ</name>
    <type>
      <types>CatalogRef.ОбщероссийскийКлассификаторОсновныхФондов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ГруппаОСРЖД</name>
    <type>
      <types>CatalogRef.абс_ГруппыОСРЖД</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/Enums/СостоянияОС/СостоянияОС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияОС</name>
  <comment>Состояния ОС</comment>
  <enumValues>
    <name>ПринятоКУчету</name>
    <comment>Принято к учету</comment>
  </enumValues>
  <enumValues>
    <name>ВведеноВЭксплуатацию</name>
    <comment>Введено в эксплуатацию</comment>
  </enumValues>
  <enumValues>
    <name>СнятоСУчета</name>
    <comment>Снято с учета</comment>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Documents/абс_РазукрупнениеОСРЖД/ManagerModule.bsl
Функция ПолучитьСтруктуруЗапросовПроведения() Экспорт

	СтруктураЗапросов = Новый Структура;
	СтруктураЗапросов.Вставить("абс_МеждународныйУчетОСРЖД_ТекстЗапросаВидыСубконтоСчетов", абс_МеждународныйУчетОСРЖД.ТекстЗапросаВидыСубконтоСчетов("ВидыСубконтоСчетов"));
	СтруктураЗапросов.Вставить("абс_МеждународныйУчетОСРЖД_ТекстЗапросаСоответствиеСчетовХозрасчетныйРЖД", абс_МеждународныйУчетОСРЖД.ТекстЗапросаСоответствиеСчетовХозрасчетныйМеждународныйОСРЖД("Период",, "СоответствиеСчетовХозрасчетныйРЖД"));
	СтруктураЗапросов.Вставить("ТекстЗапросаСоответствиеСчетовХозрасчетныйМеждународныйОСРЖД", абс_МеждународныйУчетОСРЖД.ТекстЗапросаСоответствиеСчетовХозрасчетныйМеждународныйОСРЖД("Период",, "СоответствиеСчетовХозрасчетныйРЖД"));
	
	ДобавитьЗапросыДляРазукрупнения(СтруктураЗапросов);
	
	Возврат СтруктураЗапросов;

КонецФункции

Процедура ДобавитьЗапросыДляРазукрупнения(СтруктураЗапросов)

	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ПериодыРегистраторыСреза.Период,
		|	ПериодыРегистраторыСреза.Регистратор,
		|	ПериодыРегистраторыСреза.ОсновноеСредство,
		|	абс_ОсновныеСредстваРЖД.Организация,
		|	абс_ОсновныеСредстваРЖД.ДатаПринятияКУчету,
		|	абс_ОсновныеСредстваРЖД.МестонахождениеОбъекта,
		|	абс_ОсновныеСредстваРЖД.МОЛ,
		|	абс_ОсновныеСредстваРЖД.Состояние,
		|	абс_ОсновныеСредстваРЖД.СчетУчета,
		|	абс_ОсновныеСредстваРЖД.СрокПолезногоИспользования,
		|	абс_ОсновныеСредстваРЖД.НачислятьАмортизацию,
		|	абс_ОсновныеСредстваРЖД.МетодНачисленияАмортизации,
		|	абс_ОсновныеСредстваРЖД.СчетНачисленияАмортизации,
		|	абс_ОсновныеСредстваРЖД.ПервоначальнаяСтоимость,
		|	абс_ОсновныеСредстваРЖД.СправедливаяСтоимость,
		|	абс_ОсновныеСредстваРЖД.ЛиквидационнаяСтоимость,
		|	абс_ОсновныеСредстваРЖД.СчетЗатрат,
		|	абс_ОсновныеСредстваРЖД.Субконто1,
		|	абс_ОсновныеСредстваРЖД.Субконто2,
		|	абс_ОсновныеСредстваРЖД.Субконто3,
		|	абс_ОсновныеСредстваРЖД.ПредполагаемыйОбъемПродукции,
		|	абс_ОсновныеСредстваРЖД.СуммаНачисленнойАмортизации,
		|	абс_ОсновныеСредстваРЖД.УбытокОтОбесценения,
		|	абс_ОсновныеСредстваРЖД.КоэффициентУскорения,
		|	абс_ОсновныеСредстваРЖД.СчетСниженияСтоимости
		|ПОМЕСТИТЬ ПараметрыОсновногоСредства
		|ИЗ
		|	(ВЫБРАТЬ
		|		ПериодыСреза.ОсновноеСредство КАК ОсновноеСредство,
		|		ПериодыСреза.Период КАК Период,
		|		МАКСИМУМ(абс_ОсновныеСредстваРЖД.Регистратор) КАК Регистратор
		|	ИЗ
		|		(ВЫБРАТЬ
		|			абс_ОсновныеСредстваРЖД.ОсновноеСредство КАК ОсновноеСредство,
		|			МАКСИМУМ(абс_ОсновныеСредстваРЖД.Период) КАК Период
		|		ИЗ
		|			РегистрСведений.абс_ОсновныеСредстваРЖД КАК абс_ОсновныеСредстваРЖД
		|		ГДЕ
		|			абс_ОсновныеСредстваРЖД.ОсновноеСредство = &ОсновноеСредство
		|			И абс_ОсновныеСредстваРЖД.Период <= &Период
		|			И абс_ОсновныеСредстваРЖД.Активность
		|		
		|		СГРУППИРОВАТЬ ПО
		|			абс_ОсновныеСредстваРЖД.ОсновноеСредство) КАК ПериодыСреза
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.абс_ОсновныеСредстваРЖД КАК абс_ОсновныеСредстваРЖД
		|			ПО ПериодыСреза.ОсновноеСредство = абс_ОсновныеСредстваРЖД.ОсновноеСредство
		|				И ПериодыСреза.Период = абс_ОсновныеСредстваРЖД.Период
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ПериодыСреза.ОсновноеСредство,
		|		ПериодыСреза.Период) КАК ПериодыРегистраторыСреза
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.абс_ОсновныеСредстваРЖД КАК абс_ОсновныеСредстваРЖД
		|		ПО ПериодыРегистраторыСреза.Период = абс_ОсновныеСредстваРЖД.Период
		|			И ПериодыРегистраторыСреза.Регистратор = абс_ОсновныеСредстваРЖД.Регистратор
		|			И ПериодыРегистраторыСреза.ОсновноеСредство = абс_ОсновныеСредстваРЖД.ОсновноеСредство";
		
	СтруктураЗапросов.Вставить("абс_ВнеоборотныеАктивы_ТекстЗапроса_ОсновныеСредстваРЖДПоОдномуОС", ТекстЗапроса+";");
	
    ТекстЗапроса = 
		"ВЫБРАТЬ
		|	абс_РазукрупнениеОСРЖД.Ссылка,
		|	абс_РазукрупнениеОСРЖД.Номер,
		|	абс_РазукрупнениеОСРЖД.Дата,
		|	абс_РазукрупнениеОСРЖД.Организация,
		|	абс_РазукрупнениеОСРЖД.ДокументОснование,
		|	абс_РазукрупнениеОСРЖД.ОсновноеСредство
		|ПОМЕСТИТЬ Шапкадокумента
		|ИЗ
		|	Документ.абс_РазукрупнениеОСРЖД КАК абс_РазукрупнениеОСРЖД
		|ГДЕ
		|	абс_РазукрупнениеОСРЖД.Ссылка = &Ссылка";
		
	СтруктураЗапросов.Вставить("Разукрупнение_ТекстЗапросаШапкаДокумента", ТекстЗапроса+";");
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	абс_РазукрупнениеОСРЖДОсновныеСредства.НомерСтроки,
		|	абс_РазукрупнениеОСРЖДОсновныеСредства.ОсновноеСредство,
		|	абс_РазукрупнениеОСРЖДОсновныеСредства.Коэффициент,
		|	ПараметрыОсновногоСредства.СчетУчета,
		|	ПараметрыОсновногоСредства.СчетНачисленияАмортизации,
		|	абс_РазукрупнениеОСРЖДОсновныеСредства.СчетЗатрат,
		|	абс_РазукрупнениеОСРЖДОсновныеСредства.Субконто1,
		|	абс_РазукрупнениеОСРЖДОсновныеСредства.Субконто2,
		|	абс_РазукрупнениеОСРЖДОсновныеСредства.Субконто3,
		|	абс_РазукрупнениеОСРЖДОсновныеСредства.СчетСниженияСтоимости,
		|	абс_РазукрупнениеОСРЖДОсновныеСредства.Местонахождение,
		|	абс_РазукрупнениеОСРЖДОсновныеСредства.МОЛ,
		|	абс_РазукрупнениеОСРЖДОсновныеСредства.КоэффициентУскорения,
		|	абс_РазукрупнениеОСРЖДОсновныеСредства.НачислятьАмортизацию,
		|	ПараметрыОсновногоСредства.СрокПолезногоИспользования,
		|	ПараметрыОсновногоСредства.ДатаПринятияКУчету,
		|	абс_РазукрупнениеОСРЖДОсновныеСредства.ОсновноеСредство.КодПоОКОФ КАК ОКОФ,
		|	абс_РазукрупнениеОСРЖДОсновныеСредства.ОсновноеСредство.абс_ГруппаОСРЖД КАК ГруппаОСРЖД
		|ПОМЕСТИТЬ ТабличнаяЧастьОсновныеСредства
		|ИЗ
		|	Документ.абс_РазукрупнениеОСРЖД.ОсновныеСредства КАК абс_РазукрупнениеОСРЖДОсновныеСредства,
		|	ПараметрыОсновногоСредства КАК ПараметрыОсновногоСредства
		|ГДЕ
		|	абс_РазукрупнениеОСРЖДОсновныеСредства.Ссылка = &Ссылка";
		
	СтруктураЗапросов.Вставить("Разукрупнение_ТекстЗапросаТабличнаяЧастьОсновныеСредства", ТекстЗапроса+";");
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	абс_СтоимостьОСРЖДОстатки.ОсновноеСредство,
		|	абс_СтоимостьОСРЖДОстатки.СтоимостьОстаток КАК Стоимость,
		|	абс_СтоимостьОСРЖДОстатки.АмортизацияОстаток КАК Амортизация
		|ПОМЕСТИТЬ СтоимостьСтарогоОсновногоСредства
		|ИЗ
		|	РегистрНакопления.абс_СтоимостьОСРЖД.Остатки(
		|			&МоментДокумента,
		|			ОсновноеСредство = &ОсновноеСредство
		|				И Организация = &Организация) КАК абс_СтоимостьОСРЖДОстатки";
		
	СтруктураЗапросов.Вставить("Разукрупнение_ТекстЗапросаСтоимостьСтарогоОсновногоСредства", ТекстЗапроса+";");
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ТабличнаяЧастьОсновныеСредства.НомерСтроки КАК НомерСтроки,
		|	ТабличнаяЧастьОсновныеСредства.ОсновноеСредство,
		|	ВЫРАЗИТЬ(СтоимостьСтарогоОсновногоСредства.Стоимость * ТабличнаяЧастьОсновныеСредства.Коэффициент КАК ЧИСЛО(15, 2)) КАК Стоимость,
		|	ВЫРАЗИТЬ(СтоимостьСтарогоОсновногоСредства.Амортизация * ТабличнаяЧастьОсновныеСредства.Коэффициент КАК ЧИСЛО(15, 2)) КАК Амортизация
		|ПОМЕСТИТЬ РаспределениеСтоимости
		|ИЗ
		|	ТабличнаяЧастьОсновныеСредства КАК ТабличнаяЧастьОсновныеСредства,
		|	СтоимостьСтарогоОсновногоСредства КАК СтоимостьСтарогоОсновногоСредства
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	НомерСтроки";
		
	СтруктураЗапросов.Вставить("Разукрупнение_ТекстЗапросаРаспределениеСтоимости", ТекстЗапроса+";");
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	СтоимостьСтарогоОсновногоСредства.Стоимость - ЕСТЬNULL(ВложенныйЗапрос.Стоимость, 0) КАК Стоимость,
		|	СтоимостьСтарогоОсновногоСредства.Амортизация - ЕСТЬNULL(ВложенныйЗапрос.Амортизация, 0) КАК Амортизация
		|ПОМЕСТИТЬ НераспределеннаяСтоимость
		|ИЗ
		|	СтоимостьСтарогоОсновногоСредства КАК СтоимостьСтарогоОсновногоСредства
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			СУММА(РаспределениеСтоимости.Стоимость) КАК Стоимость,
		|			СУММА(РаспределениеСтоимости.Амортизация) КАК Амортизация
		|		ИЗ
		|			РаспределениеСтоимости КАК РаспределениеСтоимости) КАК ВложенныйЗапрос
		|		ПО (ИСТИНА)";
		
	СтруктураЗапросов.Вставить("Разукрупнение_ТекстЗапросаНераспределеннаяСтоимость", ТекстЗапроса+";");
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	РаспределениеСтоимости.НомерСтроки КАК НомерСтроки,
		|	РаспределениеСтоимости.ОсновноеСредство,
		|	РаспределениеСтоимости.Стоимость + ЕСТЬNULL(НераспределеннаяСтоимость.Стоимость, 0) КАК Стоимость,
		|	РаспределениеСтоимости.Амортизация + ЕСТЬNULL(НераспределеннаяСтоимость.Амортизация, 0) КАК Амортизация
		|ПОМЕСТИТЬ СтоимостьНовыхОсновныхСредств
		|ИЗ
		|	РаспределениеСтоимости КАК РаспределениеСтоимости
		|		ЛЕВОЕ СОЕДИНЕНИЕ НераспределеннаяСтоимость КАК НераспределеннаяСтоимость
		|		ПО (РаспределениеСтоимости.НомерСтроки = 1)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	НомерСтроки";
		
	СтруктураЗапросов.Вставить("Разукрупнение_ТекстЗапросаСтоимостьНовыхОсновныхСредств", ТекстЗапроса+";");
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	&Период,
		|	ПараметрыОсновногоСредства.ОсновноеСредство,
		|	ПараметрыОсновногоСредства.Организация,
		|	ПараметрыОсновногоСредства.ДатаПринятияКУчету,
		|	ПараметрыОсновногоСредства.МестонахождениеОбъекта,
		|	ПараметрыОсновногоСредства.МОЛ,
		|	ЗНАЧЕНИЕ(Перечисление.СостоянияОС.СнятоСУчета) КАК Состояние,
		|	ПараметрыОсновногоСредства.СчетУчета,
		|	ПараметрыОсновногоСредства.СрокПолезногоИспользования,
		|	ЛОЖЬ КАК НачислятьАмортизацию,
		|	ПараметрыОсновногоСредства.МетодНачисленияАмортизации,
		|	ПараметрыОсновногоСредства.СчетНачисленияАмортизации,
		|	ПараметрыОсновногоСредства.ПервоначальнаяСтоимость,
		|	0 КАК СправедливаяСтоимость,
		|	ПараметрыОсновногоСредства.ЛиквидационнаяСтоимость,
		|	ПараметрыОсновногоСредства.СчетЗатрат,
		|	ПараметрыОсновногоСредства.Субконто1,
		|	ПараметрыОсновногоСредства.Субконто2,
		|	ПараметрыОсновногоСредства.Субконто3,
		|	ПараметрыОсновногоСредства.ПредполагаемыйОбъемПродукции,
		|	0 КАК СуммаНачисленнойАмортизации,
		|	ПараметрыОсновногоСредства.УбытокОтОбесценения,
		|	ПараметрыОсновногоСредства.КоэффициентУскорения,
		|	ПараметрыОсновногоСредства.СчетСниженияСтоимости
		|ИЗ
		|	ПараметрыОсновногоСредства КАК ПараметрыОсновногоСредства
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&Период,
		|	ТабличнаяЧастьОсновныеСредства.ОсновноеСредство,
		|	&Организация,
		|	ТабличнаяЧастьОсновныеСредства.ДатаПринятияКУчету,
		|	ТабличнаяЧастьОсновныеСредства.Местонахождение,
		|	ТабличнаяЧастьОсновныеСредства.МОЛ,
		|	ЗНАЧЕНИЕ(Перечисление.СостоянияОС.ВведеноВЭксплуатацию),
		|	ТабличнаяЧастьОсновныеСредства.СчетУчета,
		|	ВЫБОР
		|		КОГДА ТабличнаяЧастьОсновныеСредства.СрокПолезногоИспользования = 0
		|			ТОГДА ПараметрыОсновногоСредства.СрокПолезногоИспользования
		|		ИНАЧЕ ТабличнаяЧастьОсновныеСредства.СрокПолезногоИспользования
		|	КОНЕЦ,
		|	ИСТИНА,
		|	ПараметрыОсновногоСредства.МетодНачисленияАмортизации,
		|	ТабличнаяЧастьОсновныеСредства.СчетНачисленияАмортизации,
		|	ВЫРАЗИТЬ(ПараметрыОсновногоСредства.ПервоначальнаяСтоимость * ТабличнаяЧастьОсновныеСредства.Коэффициент КАК ЧИСЛО(15, 2)),
		|	ВЫРАЗИТЬ(ПараметрыОсновногоСредства.СправедливаяСтоимость * ТабличнаяЧастьОсновныеСредства.Коэффициент КАК ЧИСЛО(15, 2)),
		|	ВЫРАЗИТЬ(ПараметрыОсновногоСредства.ЛиквидационнаяСтоимость * ТабличнаяЧастьОсновныеСредства.Коэффициент КАК ЧИСЛО(15, 2)),
		|	ТабличнаяЧастьОсновныеСредства.СчетЗатрат,
		|	ТабличнаяЧастьОсновныеСредства.Субконто1,
		|	ТабличнаяЧастьОсновныеСредства.Субконто2,
		|	ТабличнаяЧастьОсновныеСредства.Субконто3,
		|	ПараметрыОсновногоСредства.ПредполагаемыйОбъемПродукции,
		|	СтоимостьНовыхОсновныхСредств.Амортизация,
		|	ВЫРАЗИТЬ(ПараметрыОсновногоСредства.УбытокОтОбесценения * ТабличнаяЧастьОсновныеСредства.Коэффициент КАК ЧИСЛО(15, 2)),
		|	ВЫБОР
		|		КОГДА ТабличнаяЧастьОсновныеСредства.КоэффициентУскорения = 0
		|			ТОГДА 1
		|		ИНАЧЕ ТабличнаяЧастьОсновныеСредства.КоэффициентУскорения
		|	КОНЕЦ,
		|	ТабличнаяЧастьОсновныеСредства.СчетСниженияСтоимости
		|ИЗ
		|	ТабличнаяЧастьОсновныеСредства КАК ТабличнаяЧастьОсновныеСредства
		|		ЛЕВОЕ СОЕДИНЕНИЕ СтоимостьНовыхОсновныхСредств КАК СтоимостьНовыхОсновныхСредств
		|		ПО ТабличнаяЧастьОсновныеСредства.НомерСтроки = СтоимостьНовыхОсновныхСредств.НомерСтроки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.абс_СоответствиеОКОФГруппОСРЖД КАК абс_СоответствиеОКОФГруппОСРЖД
		|		ПО ТабличнаяЧастьОсновныеСредства.ОКОФ = абс_СоответствиеОКОФГруппОСРЖД.ОКОФ
		|			И ТабличнаяЧастьОсновныеСредства.ГруппаОСРЖД = абс_СоответствиеОКОФГруппОСРЖД.ГруппаОСРЖД,
		|	ПараметрыОсновногоСредства КАК ПараметрыОсновногоСредства";
		
	СтруктураЗапросов.Вставить("Разукрупнение_ТекстЗапросаТаблица_абс_ОсновныеСредстваРЖД", ТекстЗапроса+";");
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	&Период КАК Период,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	&Организация КАК Организация,
		|	СтоимостьСтарогоОсновногоСредства.ОсновноеСредство КАК ОсновноеСредство,
		|	-СтоимостьСтарогоОсновногоСредства.Стоимость КАК Стоимость,
		|	-СтоимостьСтарогоОсновногоСредства.Амортизация КАК Амортизация
		|ИЗ
		|	СтоимостьСтарогоОсновногоСредства КАК СтоимостьСтарогоОсновногоСредства
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&Период,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		|	&Организация,
		|	СтоимостьНовыхОсновныхСредств.ОсновноеСредство,
		|	СтоимостьНовыхОсновныхСредств.Стоимость,
		|	СтоимостьНовыхОсновныхСредств.Амортизация
		|ИЗ
		|	СтоимостьНовыхОсновныхСредств КАК СтоимостьНовыхОсновныхСредств";
		
	СтруктураЗапросов.Вставить("Разукрупнение_ТекстЗапросаТаблица_абс_СтоимостьОСРЖД", ТекстЗапроса+";");
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	&Период,
		|	&Организация,
		|	ПараметрыОсновногоСредства.СчетУчета КАК СчетДт,
		|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства) КАК ВидСубконтоДт1,
		|	СтоимостьСтарогоОсновногоСредства.ОсновноеСредство КАК СубконтоДт1,
		|	ЗНАЧЕНИЕ(ПланСчетов.абс_МеждународныйОСРЖД.Служебный) КАК СчетКт,
		|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПустаяСсылка) КАК ВидСубконтоКт1,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоКт1,
		|	-СтоимостьСтарогоОсновногоСредства.Стоимость КАК Сумма,
		|	""Разукрупнение ОС"" КАК Содержание,
		|	Шапкадокумента.ДокументОснование КАК ПервичныйДокумент
		|ИЗ
		|	СтоимостьСтарогоОсновногоСредства КАК СтоимостьСтарогоОсновногоСредства,
		|	ПараметрыОсновногоСредства КАК ПараметрыОсновногоСредства,
		|	Шапкадокумента КАК Шапкадокумента
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&Период,
		|	&Организация,
		|	ЗНАЧЕНИЕ(ПланСчетов.абс_МеждународныйОСРЖД.Служебный),
		|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПустаяСсылка),
		|	НЕОПРЕДЕЛЕНО,
		|	ПараметрыОсновногоСредства.СчетНачисленияАмортизации,
		|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства),
		|	СтоимостьСтарогоОсновногоСредства.ОсновноеСредство,
		|	-СтоимостьСтарогоОсновногоСредства.Амортизация,
		|	""Разукрупнение ОС"",
		|	Шапкадокумента.ДокументОснование
		|ИЗ
		|	ПараметрыОсновногоСредства КАК ПараметрыОсновногоСредства,
		|	Шапкадокумента КАК Шапкадокумента,
		|	СтоимостьСтарогоОсновногоСредства КАК СтоимостьСтарогоОсновногоСредства
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&Период,
		|	&Организация,
		|	ТабличнаяЧастьОсновныеСредства.СчетУчета,
		|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства),
		|	ТабличнаяЧастьОсновныеСредства.ОсновноеСредство,
		|	ЗНАЧЕНИЕ(ПланСчетов.абс_МеждународныйОСРЖД.Служебный),
		|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПустаяСсылка),
		|	НЕОПРЕДЕЛЕНО,
		|	СтоимостьНовыхОсновныхСредств.Стоимость,
		|	""Разукрупнение ОС"",
		|	Шапкадокумента.ДокументОснование
		|ИЗ
		|	ТабличнаяЧастьОсновныеСредства КАК ТабличнаяЧастьОсновныеСредства
		|		ЛЕВОЕ СОЕДИНЕНИЕ СтоимостьНовыхОсновныхСредств КАК СтоимостьНовыхОсновныхСредств
		|		ПО ТабличнаяЧастьОсновныеСредства.НомерСтроки = СтоимостьНовыхОсновныхСредств.НомерСтроки,
		|	Шапкадокумента КАК Шапкадокумента
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&Период,
		|	&Организация,
		|	ЗНАЧЕНИЕ(ПланСчетов.абс_МеждународныйОСРЖД.Служебный),
		|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПустаяСсылка),
		|	НЕОПРЕДЕЛЕНО,
		|	ТабличнаяЧастьОсновныеСредства.СчетНачисленияАмортизации,
		|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства),
		|	СтоимостьНовыхОсновныхСредств.ОсновноеСредство,
		|	СтоимостьНовыхОсновныхСредств.Амортизация,
		|	""Разукрупнение ОС"",
		|	Шапкадокумента.ДокументОснование
		|ИЗ
		|	ТабличнаяЧастьОсновныеСредства КАК ТабличнаяЧастьОсновныеСредства
		|		ЛЕВОЕ СОЕДИНЕНИЕ СтоимостьНовыхОсновныхСредств КАК СтоимостьНовыхОсновныхСредств
		|		ПО ТабличнаяЧастьОсновныеСредства.НомерСтроки = СтоимостьНовыхОсновныхСредств.НомерСтроки,
		|	Шапкадокумента КАК Шапкадокумента";
		
	СтруктураЗапросов.Вставить("Разукрупнение_ТекстЗапросаТаблица_абс_МеждународныйОСРЖД", ТекстЗапроса+";");
	
	ТекстЗапроса = 
		"УНИЧТОЖИТЬ ПараметрыОсновногоСредства";
		
	СтруктураЗапросов.Вставить("Разукрупнение_УдалениеВременныхТаблиц", ТекстЗапроса+";");
	
КонецПроцедуры














/////////////////////////////////////////////////////////////////////////////////
// Программный интерфейс проведения документов

Процедура ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства, Отказ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Период", Ссылка.Дата);
	Запрос.УстановитьПараметр("МоментДокумента", Новый Граница(Ссылка.МоментВремени(), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Организация", Ссылка.Организация);
	Запрос.УстановитьПараметр("ОсновноеСредство", Ссылка.ОсновноеСредство);
	Запрос.УстановитьПараметр("ДокументОснование", Ссылка.ДокументОснование);
	
	ТекстыЗапросов = Новый СписокЗначений;
	
	ТекстыЗапросов.Добавить(ТекстЗапросаТабличнаяЧастьОсновныеСредства(), "");
	ТекстыЗапросов.Добавить(абс_ВнеоборотныеАктивы.ТекстЗапроса_ОсновныеСредстваРЖДПоОдномуОС("ОсновноеСредство", "Период", "ПараметрыОсновногоСредства"), "");
	ТекстыЗапросов.Добавить(ТекстЗапросаСтоимостьСтарогоОсновногоСредства(), "");
	ТекстыЗапросов.Добавить(ТекстЗапросаИзменениеСтоимостиОсновныхСредств(), "");
	
	ТекстыЗапросов.Добавить(ТекстЗапросаТаблица_абс_ОсновныеСредстваРЖД(), "Таблица_абс_ОсновныеСредстваРЖД");
	ТекстыЗапросов.Добавить(ТекстЗапросаТаблица_абс_СтоимостьОСРЖД(), "Таблица_абс_СтоимостьОСРЖД");
	ТекстыЗапросов.Добавить(ТекстЗапросаТаблица_абс_МеждународныйОСРЖД(), "Таблица_абс_МеждународныйОСРЖД");
	
	абс_ПроведениеДокументов.ИницализироватьТаблицыДляДвижений(Запрос, ТекстыЗапросов, ДополнительныеСвойства.ТаблицыДляДвижений);
	
КонецПроцедуры


/////////////////////////////////////////////////////////////////////////////////
// Функции, возвращающие тексты запросов для инициализации данных документа

Функция ТекстЗапросаТабличнаяЧастьОсновныеСредства()
	
	Возврат "ВЫБРАТЬ
	        |	абс_РазукрупнениеОСРЖДОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	        |	абс_РазукрупнениеОСРЖДОсновныеСредства.Коэффициент,
	        |	абс_РазукрупнениеОСРЖДОсновныеСредства.СчетУчета,
	        |	абс_РазукрупнениеОСРЖДОсновныеСредства.СчетНачисленияАмортизации,
	        |	абс_РазукрупнениеОСРЖДОсновныеСредства.СчетЗатрат,
	        |	абс_РазукрупнениеОСРЖДОсновныеСредства.Субконто1,
	        |	абс_РазукрупнениеОСРЖДОсновныеСредства.Субконто2,
	        |	абс_РазукрупнениеОСРЖДОсновныеСредства.Субконто3,
	        |	абс_РазукрупнениеОСРЖДОсновныеСредства.СчетСниженияСтоимости,
	        |	абс_РазукрупнениеОСРЖДОсновныеСредства.Местонахождение,
	        |	абс_РазукрупнениеОСРЖДОсновныеСредства.МОЛ,
	        |	абс_РазукрупнениеОСРЖДОсновныеСредства.КоэффициентУскорения,
	        |	абс_РазукрупнениеОСРЖДОсновныеСредства.НачислятьАмортизацию,
	        |	абс_РазукрупнениеОСРЖДОсновныеСредства.СрокПолезногоИспользования,
	        |	абс_РазукрупнениеОСРЖДОсновныеСредства.ДатаПринятияКУчету,
	        |	абс_РазукрупнениеОСРЖДОсновныеСредства.ОсновноеСредство.КодПоОКОФ КАК ОКОФ,
	        |	абс_РазукрупнениеОСРЖДОсновныеСредства.ОсновноеСредство.абс_ГруппаОСРЖД КАК ГруппаОСРЖД,
	        |	абс_РазукрупнениеОСРЖДОсновныеСредства.МетодНачисленияАмортизации
	        |ПОМЕСТИТЬ ТабличнаяЧастьОсновныеСредства
	        |ИЗ
	        |	Документ.абс_РазукрупнениеОСРЖД.ОсновныеСредства КАК абс_РазукрупнениеОСРЖДОсновныеСредства
	        |ГДЕ
	        |	абс_РазукрупнениеОСРЖДОсновныеСредства.Ссылка = &Ссылка
	        |
	        |ИНДЕКСИРОВАТЬ ПО
	        |	ОсновноеСредство
			|;
			|";
	
КонецФункции

Функция ТекстЗапросаСтоимостьСтарогоОсновногоСредства()
	
	Возврат "ВЫБРАТЬ
	        |	абс_СтоимостьОСРЖДОстатки.ОсновноеСредство,
	        |	абс_СтоимостьОСРЖДОстатки.СтоимостьОстаток КАК Стоимость,
	        |	абс_СтоимостьОСРЖДОстатки.АмортизацияОстаток КАК Амортизация
	        |ПОМЕСТИТЬ СтоимостьСтарогоОсновногоСредства
	        |ИЗ
	        |	РегистрНакопления.абс_СтоимостьОСРЖД.Остатки(
	        |			&МоментДокумента,
	        |			ОсновноеСредство = &ОсновноеСредство
	        |				И Организация = &Организация) КАК абс_СтоимостьОСРЖДОстатки
			|;
			|";
	
КонецФункции

Функция ТекстЗапросаИзменениеСтоимостиОсновныхСредств()
	
	Возврат "ВЫБРАТЬ
	        |	ВложенныйЗапрос.ОсновноеСредство,
	        |	СУММА(ВложенныйЗапрос.Стоимость) КАК Стоимость,
	        |	СУММА(ВложенныйЗапрос.Амортизация) КАК Амортизация
	        |ПОМЕСТИТЬ ИзменениеСтоимостиОсновныхСредств
	        |ИЗ
	        |	(ВЫБРАТЬ
	        |		СтоимостьСтарогоОсновногоСредства.ОсновноеСредство КАК ОсновноеСредство,
	        |		-СтоимостьСтарогоОсновногоСредства.Стоимость КАК Стоимость,
	        |		-СтоимостьСтарогоОсновногоСредства.Амортизация КАК Амортизация
	        |	ИЗ
	        |		СтоимостьСтарогоОсновногоСредства КАК СтоимостьСтарогоОсновногоСредства
	        |	
	        |	ОБЪЕДИНИТЬ ВСЕ
	        |	
	        |	ВЫБРАТЬ
	        |		ТабличнаяЧастьОсновныеСредства.ОсновноеСредство,
	        |		ВЫРАЗИТЬ(ЕСТЬNULL(СтоимостьСтарогоОсновногоСредства.Стоимость, 0) * ТабличнаяЧастьОсновныеСредства.Коэффициент КАК ЧИСЛО(15, 2)),
	        |		ВЫРАЗИТЬ(ЕСТЬNULL(СтоимостьСтарогоОсновногоСредства.Амортизация, 0) * ТабличнаяЧастьОсновныеСредства.Коэффициент КАК ЧИСЛО(15, 2))
	        |	ИЗ
	        |		ТабличнаяЧастьОсновныеСредства КАК ТабличнаяЧастьОсновныеСредства
	        |			ЛЕВОЕ СОЕДИНЕНИЕ СтоимостьСтарогоОсновногоСредства КАК СтоимостьСтарогоОсновногоСредства
	        |			ПО (ИСТИНА)) КАК ВложенныйЗапрос
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ВложенныйЗапрос.ОсновноеСредство
			|;
			|";
	
КонецФункции



Функция ТекстЗапросаТаблица_абс_ОсновныеСредстваРЖД()
	
	Возврат "ВЫБРАТЬ
	        |	&Период,
	        |	ТабличнаяЧастьОсновныеСредства.ОсновноеСредство,
	        |	&Организация,
	        |	ТабличнаяЧастьОсновныеСредства.ДатаПринятияКУчету,
	        |	ТабличнаяЧастьОсновныеСредства.Местонахождение КАК МестонахождениеОбъекта,
	        |	ТабличнаяЧастьОсновныеСредства.МОЛ,
	        |	ЗНАЧЕНИЕ(Перечисление.СостоянияОС.ВведеноВЭксплуатацию) КАК Состояние,
	        |	ТабличнаяЧастьОсновныеСредства.СчетУчета,
	        |	ТабличнаяЧастьОсновныеСредства.СрокПолезногоИспользования,
	        |	ТабличнаяЧастьОсновныеСредства.НачислятьАмортизацию,
	        |	ТабличнаяЧастьОсновныеСредства.МетодНачисленияАмортизации,
	        |	ТабличнаяЧастьОсновныеСредства.СчетНачисленияАмортизации,
	        |	ВЫРАЗИТЬ(ЕСТЬNULL(ПараметрыОсновногоСредства.ПервоначальнаяСтоимость, ЕСТЬNULL(СтоимостьСтарогоОсновногоСредства.Стоимость, 0)) * ТабличнаяЧастьОсновныеСредства.Коэффициент КАК ЧИСЛО(15, 2)) КАК ПервоначальнаяСтоимость,
	        |	ВЫРАЗИТЬ(ЕСТЬNULL(ПараметрыОсновногоСредства.СправедливаяСтоимость, 0) * ТабличнаяЧастьОсновныеСредства.Коэффициент КАК ЧИСЛО(15, 2)) КАК СправедливаяСтоимость,
	        |	ВЫРАЗИТЬ(ЕСТЬNULL(ПараметрыОсновногоСредства.ЛиквидационнаяСтоимость, 0) * ТабличнаяЧастьОсновныеСредства.Коэффициент КАК ЧИСЛО(15, 2)) КАК ЛиквидационнаяСтоимость,
	        |	ТабличнаяЧастьОсновныеСредства.СчетЗатрат,
	        |	ТабличнаяЧастьОсновныеСредства.Субконто1,
	        |	ТабличнаяЧастьОсновныеСредства.Субконто2,
	        |	ТабличнаяЧастьОсновныеСредства.Субконто3,
	        |	ЕСТЬNULL(ПараметрыОсновногоСредства.ПредполагаемыйОбъемПродукции, 0) КАК ПредполагаемыйОбъемПродукции,
	        |	ВЫРАЗИТЬ(ЕСТЬNULL(СтоимостьСтарогоОсновногоСредства.Амортизация, 0) * ТабличнаяЧастьОсновныеСредства.Коэффициент КАК ЧИСЛО(15, 2)) КАК СуммаНачисленнойАмортизации,
	        |	ВЫРАЗИТЬ(ЕСТЬNULL(ПараметрыОсновногоСредства.УбытокОтОбесценения, 0) * ТабличнаяЧастьОсновныеСредства.Коэффициент КАК ЧИСЛО(15, 2)) КАК УбытокОтОбесценения,
	        |	ТабличнаяЧастьОсновныеСредства.КоэффициентУскорения,
	        |	ТабличнаяЧастьОсновныеСредства.СчетСниженияСтоимости
	        |ИЗ
	        |	ТабличнаяЧастьОсновныеСредства КАК ТабличнаяЧастьОсновныеСредства
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ПараметрыОсновногоСредства КАК ПараметрыОсновногоСредства
	        |		ПО (ИСТИНА),
	        |	СтоимостьСтарогоОсновногоСредства КАК СтоимостьСтарогоОсновногоСредства
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	&Период,
	        |	ПараметрыОсновногоСредства.ОсновноеСредство,
	        |	ПараметрыОсновногоСредства.Организация,
	        |	ПараметрыОсновногоСредства.ДатаПринятияКУчету,
	        |	ПараметрыОсновногоСредства.МестонахождениеОбъекта,
	        |	ПараметрыОсновногоСредства.МОЛ,
	        |	ЗНАЧЕНИЕ(Перечисление.СостоянияОС.СнятоСУчета),
	        |	ПараметрыОсновногоСредства.СчетУчета,
	        |	ПараметрыОсновногоСредства.СрокПолезногоИспользования,
	        |	ЛОЖЬ,
	        |	ПараметрыОсновногоСредства.МетодНачисленияАмортизации,
	        |	ПараметрыОсновногоСредства.СчетНачисленияАмортизации,
	        |	ПараметрыОсновногоСредства.ПервоначальнаяСтоимость,
	        |	ПараметрыОсновногоСредства.СправедливаяСтоимость,
	        |	ПараметрыОсновногоСредства.ЛиквидационнаяСтоимость,
	        |	ПараметрыОсновногоСредства.СчетЗатрат,
	        |	ПараметрыОсновногоСредства.Субконто1,
	        |	ПараметрыОсновногоСредства.Субконто2,
	        |	ПараметрыОсновногоСредства.Субконто3,
	        |	ПараметрыОсновногоСредства.ПредполагаемыйОбъемПродукции,
	        |	ПараметрыОсновногоСредства.СуммаНачисленнойАмортизации,
	        |	ПараметрыОсновногоСредства.УбытокОтОбесценения,
	        |	ПараметрыОсновногоСредства.КоэффициентУскорения,
	        |	ПараметрыОсновногоСредства.СчетСниженияСтоимости
	        |ИЗ
	        |	ПараметрыОсновногоСредства КАК ПараметрыОсновногоСредства
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ТабличнаяЧастьОсновныеСредства КАК ТабличнаяЧастьОсновныеСредства
	        |		ПО ПараметрыОсновногоСредства.ОсновноеСредство = ТабличнаяЧастьОсновныеСредства.ОсновноеСредство
	        |ГДЕ
	        |	ТабличнаяЧастьОсновныеСредства.ОсновноеСредство ЕСТЬ NULL
			|;
			|";
	
КонецФункции

Функция ТекстЗапросаТаблица_абс_СтоимостьОСРЖД()
	
	Возврат "ВЫБРАТЬ
	        |	&Период,
	        |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	        |	&Организация,
	        |	ИзменениеСтоимостиОсновныхСредств.ОсновноеСредство,
	        |	ИзменениеСтоимостиОсновныхСредств.Стоимость,
	        |	ИзменениеСтоимостиОсновныхСредств.Амортизация
	        |ИЗ
	        |	ИзменениеСтоимостиОсновныхСредств КАК ИзменениеСтоимостиОсновныхСредств
			|;
			|";
	
КонецФункции

Функция ТекстЗапросаТаблица_абс_МеждународныйОСРЖД()
	
	Возврат "ВЫБРАТЬ
	        |	&Период,
	        |	&Организация,
	        |	ЕСТЬNULL(ТабличнаяЧастьОсновныеСредства.СчетУчета, ПараметрыОсновногоСредства.СчетУчета) КАК СчетДт,
	        |	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства) КАК ВидСубконтоДт1,
	        |	ИзменениеСтоимостиОсновныхСредств.ОсновноеСредство КАК СубконтоДт1,
	        |	ЗНАЧЕНИЕ(ПланСчетов.абс_МеждународныйОСРЖД.Служебный) КАК СчетКт,
	        |	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПустаяСсылка) КАК ВидСубконтоКт1,
	        |	НЕОПРЕДЕЛЕНО КАК СубконтоКт1,
	        |	ИзменениеСтоимостиОсновныхСредств.Стоимость КАК Сумма,
	        |	&ДокументОснование КАК ПервичныйДокумент
	        |ИЗ
	        |	ИзменениеСтоимостиОсновныхСредств КАК ИзменениеСтоимостиОсновныхСредств
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ТабличнаяЧастьОсновныеСредства КАК ТабличнаяЧастьОсновныеСредства
	        |		ПО ИзменениеСтоимостиОсновныхСредств.ОсновноеСредство = ТабличнаяЧастьОсновныеСредства.ОсновноеСредство
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ПараметрыОсновногоСредства КАК ПараметрыОсновногоСредства
	        |		ПО ИзменениеСтоимостиОсновныхСредств.ОсновноеСредство = ПараметрыОсновногоСредства.ОсновноеСредство
	        |ГДЕ
	        |	ИзменениеСтоимостиОсновныхСредств.Стоимость <> 0
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	&Период,
	        |	&Организация,
	        |	ЗНАЧЕНИЕ(ПланСчетов.абс_МеждународныйОСРЖД.Служебный),
	        |	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПустаяСсылка),
	        |	НЕОПРЕДЕЛЕНО,
	        |	ЕСТЬNULL(ТабличнаяЧастьОсновныеСредства.СчетНачисленияАмортизации, ПараметрыОсновногоСредства.СчетНачисленияАмортизации),
	        |	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства),
	        |	ИзменениеСтоимостиОсновныхСредств.ОсновноеСредство,
	        |	ИзменениеСтоимостиОсновныхСредств.Амортизация,
	        |	&ДокументОснование
	        |ИЗ
	        |	ИзменениеСтоимостиОсновныхСредств КАК ИзменениеСтоимостиОсновныхСредств
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ТабличнаяЧастьОсновныеСредства КАК ТабличнаяЧастьОсновныеСредства
	        |		ПО ИзменениеСтоимостиОсновныхСредств.ОсновноеСредство = ТабличнаяЧастьОсновныеСредства.ОсновноеСредство
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ПараметрыОсновногоСредства КАК ПараметрыОсновногоСредства
	        |		ПО ИзменениеСтоимостиОсновныхСредств.ОсновноеСредство = ПараметрыОсновногоСредства.ОсновноеСредство
	        |ГДЕ
	        |	ИзменениеСтоимостиОсновныхСредств.Амортизация <> 0
			|;
			|";
	
КонецФункции
